; domain
(define (domain blocksworld)
    (:predicates (clear ?x) (holding ?x) (on ?x ?y)
                 (on-table ?x) (arm-empty)
    )
    (:action stack
     :parameters (?x ?y)
     :precondition (and (clear ?y) (holding ?x))
     :effect (and (arm-empty) (on ?x ?y)
                  (not (clear ?y)) (not (holding ?x)))
    )
    (:action unstack
     :parameters (?x ?y)
     :precondition (and (arm-empty) (on ?x ?y) (clear ?x))
     :effect (and (not (arm-empty)) (holding ?x) (not (on ?x ?y)) (clear ?y))
    )
    (:action pickup
     :parameters (?x)
     :precondition (and (arm-empty) (clear ?x) (on-table ?x))
     :effect (and (not (arm-empty)) (holding ?x))
    )
    (:action drop
     :parameters (?x)
     :precondition (and (holding ?x) (not (arm-empty)))
     :effect (and (arm-empty) (not (holding ?x)) (on-table ?x))
    )
)

; problem
(define (problem bw-abcde)
    (:domain blocksworld)
    (:objects a b c d e)
    (:init (on-table a) (clear a)
           (on-table b) (clear b)
           (on-table e) (clear e)
           (on-table c) (on d c) (clear d)
           (arm-empty)
    )
    (:goal (and (on e c) (on c a) (on b d)))
)

; plan
1. (unstack d c)
   deleted: (arm-empty) (on d c)
   added: (holding d) (clear c)
   goals met: 0 of 3
2. (drop d)
   deleted: (holding d)
   added: (arm-empty) (on-table d)
   goals met: 0 of 3
3. (pickup b)
   deleted: (arm-empty)
   added: (holding b)
   goals met: 0 of 3
4. (stack b d)
   deleted: (clear d) (holding b)
   added: (arm-empty) (on b d)
   goals met: 1 of 3
5. (pickup c)
   deleted: (arm-empty)
   added: (holding c)
   goals met: 1 of 3
6. (stack c a)
   deleted: (clear a) (holding c)
   added: (arm-empty) (on c a)
   goals met: 2 of 3
7. (pickup e)
   deleted: (arm-empty)
   added: (holding e)
   goals met: 2 of 3
8. (stack e c)
   deleted: (clear c) (holding e)
   added: (arm-empty) (on e c)
   goals met: 3 of 3
